# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

nc: 80  # number of classes

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, conv_bn_hswish, [16, 2]]                              # 0-p1/2

  - [-1, 1, MobileNetV3_InvertedResidual, [16,  16, 3, 2, 1, 0]]  # 1-p2/4

  - [-1, 1, MobileNetV3_InvertedResidual, [24,  72, 3, 2, 0, 0]]  # 2-p3/8
  - [-1, 1, MobileNetV3_InvertedResidual, [24,  88, 3, 1, 0, 0]]  # 3

  - [-1, 1, MobileNetV3_InvertedResidual, [40,  96, 5, 2, 1, 1]]  # 4-p4/16
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]  # 5
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]  # 6
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 120, 5, 1, 1, 1]]  # 7
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 144, 5, 1, 1, 1]]  # 8

  - [-1, 1, MobileNetV3_InvertedResidual, [96, 288, 5, 2, 1, 1]]  # 9-p5/32
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]  # 10
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]  # 11
  - [-1, 3, LocalGlobalAttention, [24, 12]]  # LocalGlobalAttention block

head:
  - [-1, 1, Classify, [nc]]  # Classify
